{
  "title": "battery_xct_workflows: Open Jupyter Notebooks for Lithium-Ion Battery QA using XCT",
  "description": "A collection of open, reproducible Jupyter notebooks for quantitative analysis and quality assurance of lithium-ion batteries using X-ray computed tomography (XCT). The workflows include electrode overhang analysis, battery canister assesment, and unrolling of cylindrical jelly-roll structures into polar coordinates for quality assurance.",
  "creators": [
    {
      "name": "Jones, Matthew P.",
      "orcid": "0000-0001-6628-1464",
      "affiliation": "Electrochemical Innovation Lab, Department of Chemical Engineering, UCL, UK; Advanced Propulsion Lab, Marshgate Building, UCL, UK"
    },
    {
      "name": "Reid, Hamish T.",
      "affiliation": "Electrochemical Innovation Lab, Department of Chemical Engineering, UCL, UK; Advanced Propulsion Lab, Marshgate Building, UCL, UK"
    },
    {
      "name": "Iacoviello, Francesco",
      "affiliation": "Electrochemical Innovation Lab, Department of Chemical Engineering, UCL, UK; Advanced Propulsion Lab, Marshgate Building, UCL, UK"
    },
    {
      "name": "Shearing, Paul R.",
      "affiliation": "The Faraday Institution, Harwell Science and Innovation Campus, Didcot, UK; The ZERO Institute, The University of Oxford, Oxon, UK"
    },
    {
      "name": "Jervis, Rhodri",
      "affiliation": "Electrochemical Innovation Lab, Department of Chemical Engineering, UCL, UK; Advanced Propulsion Lab, Marshgate Building, UCL, UK; The Faraday Institution, Harwell Science and Innovation Campus, Didcot, UK"
    }
  ],
  "keywords": [
    "batteries",
    "x-ray computed tomography",
    "quality assurance",
    "image analysis",
    "Jupyter notebooks"
  ],
  "license": "MIT",
  "upload_type": "software",
  "publication_date": "2025-09-26",
  "access_right": "open",
  "notes": "Repository accompanying a Journal of Open Source Software (JOSS) submission. Includes example data, analysis notebooks, and supporting utilities.",
  "related_identifiers": [
    {
      "relation": "isSupplementTo",
      "identifier": "https://github.com/MPJ-Imaging/battery_xct_workflows",
      "resource_type": "software"
    }
  ]
}
